MrArthurP/Energy-Efficiency-Fuzzy-eFLL/Stm32-Nucleo/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
# include <math.h>
# include <stdio.h>
# include <stdlib.h>
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "main.h"
/* MACHINE LEARNING / CONTROLLER includes */
#include "fuzzy-controller.h"
#include "eFLL_wrapper.h"
#include "reg_modelo.h"
#include "dec_modelo.h"
/* SERIAL MONITOR includes */
#include "serial_logger.h"
/* CONTROLLER INIT REPORTER AND EVALUATION includes */
#include "controller_reporter.h"
#include "controller_profiler.h"
/* STM32 HAL includes */
# include "stm32f3xx_hal.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
Fuzzy *fuzzy = NULL;
UART_HandleTypeDef huart2;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* USER CODE BEGIN 2 */

  //* Inicializa UART2 para debug e registra o logger */
  {
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    /* Enable clocks */
    __HAL_RCC_USART2_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    /* PA2 TX PA3 RX */
    GPIO_InitStruct.Pin = GPIO_PIN_2|GPIO_PIN_3;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Configure huart2 */
    huart2.Instance = USART2;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    HAL_UART_Init(&huart2);

    /* Aguarda o terminal serial abrir e estabilizar antes de enviar a mensagem. */
    HAL_Delay(2000);
    {
      uint8_t msg[] = "Placa Inicializada com Sucesso!\r\n";
      HAL_UART_Transmit(&huart2, msg, sizeof(msg) - 1, 1000);
    }

    SerialLogger_Init(&huart2);
    /* Diagnostic message to verify serial output immediately after init */
    SerialLogger_Printf("[BOOT] Serial initialized (115200 8N1)\r\n");
  }
  /* Inicializa o função de avaliação */
  ControllerProfiler_Init();

  /* Inicializa e reporta os controladores (Fuzzy, Logistic e DecisionTree) */
  if (ControllerReporter_InitController(CTRL_TYPE_LOGISTIC) != 0 || ControllerReporter_InitController(CTRL_TYPE_FUZZY) != 0 || ControllerReporter_InitController(CTRL_TYPE_DECISION_TREE) != 0)
  {
    Error_Handler();
  }

  float passo = 100.0/299.0;

  float bateria_pct = 0.0; /* variável que carrega procentagem de bateria */
  float taxa_normalizada = 0.0; /* variável que carrega o valor da taxa de sinal recebido */
 

  int index = 0;
  

  ControllerProfiler_MedirEReportar("Fuzzy",          FuzModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);
  ControllerProfiler_MedirEReportar("Logistica",      RegModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);
  ControllerProfiler_MedirEReportar("ArvoreDecisao",  DecModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    if (index < 300) {
      
      index++;

      bateria_pct = 100 - (index * passo); /* valor da bateria começando em 100 e acabando em 0 */
      taxa_normalizada = rand() % 100; /* valor da taxa de sinal aleatória entre 0-100 */ 

      if (taxa_normalizada == 99) { /* normativa do sinal - taxa = 99 é equivalente a sem sinal */
        taxa_normalizada = 0;
      }

      ControllerProfiler_MedirEReportar("Fuzzy",          FuzModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);
      ControllerProfiler_MedirEReportar("Logistica",      RegModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);
      ControllerProfiler_MedirEReportar("ArvoreDecisao",  DecModelo_DecideLigarGPRS, bateria_pct, taxa_normalizada, index);

    } 

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
